openfoam_case/0/epsilon
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}

dimensions      [0 2 -3 0 0 0 0];
internalField   uniform 0.00377336;

boundaryField
{
    inlet       { type fixedValue; value uniform 0.00377336; }
    outlet      { type zeroGradient; }
    ground      { type epsilonWallFunction; value uniform 0.00377336; }
    top         { type zeroGradient; }
    sides       { type zeroGradient; }
    buildings   { type epsilonWallFunction; value uniform 0.00377336; }
}
